<?php

use yii\db\Migration;

/**
 * Handles the data insertion for table `{{%galery}}`.
 */
class m200521_103153_insert_data_into_galery extends Migration
{
    /**
     * @inheritdoc
     */
    public function safeUp()
    {
        
$this->batchInsert('{{%galery}}', ['id','category','timestamp','title','description','full_text','alt','price'], [
			['1','kitchen','1588611978','Кухня бостон.Эмаль + шпон','','','Кухня бостон.Эмаль + шпон',''],
			['2','kitchen','1588611910','Кухня в классическом стиле.','','','Кухня в классическом стиле.',''],
			['3','kitchen','1588611997','Кухня. Фасады пластик.\"Фартук\" с фотопечатью.','','','Кухня. Фасады пластик.\"Фартук\" с фотопечатью.',''],
			['4','kitchen','1588612005','Кухня в классическом стиле','','','Кухня в классическом стиле',''],
			['5','kitchen','1588611906','Кухня с барной стойкой.Фасады пластик.','','','Кухня с барной стойкой.Фасады пластик.',''],
			['6','kitchen','1588611898','Кухня в классическом стиле','','','Кухня в классическом стиле',''],
			['7','kitchen','1588611779','Кухня с пластиковыми фасадами','','','Кухня с пластиковыми фасадами',''],
			['8','kitchen','1588611862','Кухня в классическом стиле.Фасады массив березы.','','','Кухня в классическом стиле.Фасады массив березы.',''],
			['9','kitchen','1588611860','Кухня с фасадами с фотопечатью.','','','Кухня с фасадами с фотопечатью.',''],
			['10','kitchen','1588611831','Кухня фасады МДФ эмаль - краска','','','Кухня фасады МДФ эмаль - краска',''],
			['11','kitchen','1588611997','Кухня в классическом стиле','','','Кухня в классическом стиле',''],
			['12','kitchen','1588611870','Кухня с пластиковыми фасадами','','','Кухня с пластиковыми фасадами',''],
			['13','kitchen','1588611972','Кухня с пластиковыми фасадами','','','Кухня с пластиковыми фасадами',''],
			['14','kitchen','1588611982','Кухня в классическом стиле.','','','Кухня в классическом стиле.',''],
			['15','kitchen','1588611770','Кухня в классическом стиле.','','','Кухня в классическом стиле.',''],
			['16','kitchen','1588611819','Кухня.Фасады пластик.','','','Кухня.Фасады пластик.',''],
			['17','kitchen','1588611843','Кухня с пластиковыми фасадами.','','','Кухня с пластиковыми фасадами.',''],
			['18','kitchen','1588611933','Кухня фасады пластик, шпон','','','Кухня фасады пластик, шпон',''],
			['19','kupe','1588611985','Радиусный шкаф-купе 1','','','Радиусный шкаф-купе 1',''],
			['20','kupe','1588611780','Радиусный шкаф-купе 2','','','Радиусный шкаф-купе 2',''],
			['21','kupe','1588611849','Радиусный шкаф-купе 3','','','Радиусный шкаф-купе 3',''],
			['22','kupe','1588611893','Радиусный шкаф-купе 4','','','Радиусный шкаф-купе 4',''],
			['23','kupe','1588611819','Радиусный шкаф-купе 5','','','Радиусный шкаф-купе 5',''],
			['24','kupe','1588611992','Радиусный шкаф-купе 6','','','Радиусный шкаф-купе 6',''],
			['25','kupe','1588612001','Радиусный шкаф-купе 7','','','Радиусный шкаф-купе 7',''],
			['26','kupe','1588611957','Радиусный шкаф-купе 8','','','Радиусный шкаф-купе 8',''],
			['27','kupe','1588611953','Радиусный шкаф-купе 9','','','Радиусный шкаф-купе 9',''],
			['28','kupe','1588611800','Радиусный шкаф-купе 10','','','Радиусный шкаф-купе 10',''],
			['29','kupe','1588611851','Радиусный шкаф-купе 11','','','Радиусный шкаф-купе 11',''],
			['30','kupe','1588611892','Радиусный шкаф-купе 12','','','Радиусный шкаф-купе 12',''],
			['31','kupe','1588611823','Радиусный шкаф-купе 13','','','Радиусный шкаф-купе 13',''],
			['32','kupe','1588611834','Радиусный шкаф-купе 14','','','Радиусный шкаф-купе 14',''],
			['33','kupe','1588611933','Радиусный шкаф-купе 15','','','Радиусный шкаф-купе 15',''],
			['34','kupe','1588611822','Радиусный шкаф-купе 16','','','Радиусный шкаф-купе 16',''],
			['35','kupe','1588611813','Радиусный шкаф-купе 17','','','Радиусный шкаф-купе 17',''],
			['36','kupe','1588611771','Радиусный шкаф-купе 18','','','Радиусный шкаф-купе 18',''],
			['37','kupe','1588611897','Радиусный шкаф-купе 19','','','Радиусный шкаф-купе 19',''],
			['39','lkupe','1588611990','Шкаф-купе фото1','','','Шкаф-купе фото1',''],
			['40','wall','1588611852','Стенка фото1','','','',''],
			['41','office','1588611837','Офисная мебель фото1','','стол  + 2 шкафа','Офисная мебель фото1','36 000'],
			['42','childrens','1588611961','Детская комната фото1','','','Детская комната',''],
			['44','hall','1588611892','Прихожая фото1','','','Прихожая фото1',''],
			['45','bedroom','1588611997','Спальная комната фото1','','','',''],
			['46','bedroom','1588611900','Спальная комната фото2','','','',''],
			['48','lkupe','1588611927','Шкаф-купе фото2','','','',''],
			['49','lkupe','1588611900','Шкаф-купе фото3','','','',''],
			['50','lkupe','1588611911','Шкаф-купе фото4','','','',''],
			['51','lkupe','1588612000','Шкаф-купе фото5','','','',''],
			['52','lkupe','1588611822','Шкаф-купе фото6','','','Шкаф-купе фото6',''],
			['53','lkupe','1588611787','Шкаф-купе фото7','','','',''],
			['54','lkupe','1588611909','Шкаф-купе фото8','','','',''],
			['55','lkupe','1588611937','Шкаф-купе фото9','','','',''],
			['56','lkupe','1588611991','Шкаф-купе фото10','','','',''],
			['57','lkupe','1588611941','Шкаф-купе фото11','','','',''],
			['58','lkupe','1588611771','Шкаф-купе фото12','','','',''],
			['59','lkupe','1588611807','Шкаф-купе фото13','','','',''],
			['60','lkupe','1588611940','Шкаф-купе фото14','','','Шкаф-купе фото14',''],
			['61','lkupe','1588611834','Шкаф-купе фото15','','','',''],
			['62','lkupe','1588611771','Шкаф-купе фото16','','','',''],
			['63','lkupe','1588611895','Шкаф-купе фото17','','','',''],
			['64','lkupe','1588611768','Шкаф-купе фото18','','','',''],
			['65','lkupe','1588611906','Шкаф-купе фото19','','','',''],
			['66','lkupe','1588611788','Шкаф-купе фото20','','','',''],
			['67','lkupe','1588611898','Шкаф-купе фото21','','','',''],
			['68','lkupe','1588611876','Шкаф-купе фото22','','','',''],
			['69','lkupe','1588611943','Шкаф-купе фото23','','','',''],
			['70','lkupe','1588611982','Шкаф-купе фото24','','','',''],
			['71','wall','1588611771','Стенка фото2','','','',''],
			['72','wall','1588612001','Стенка фото3','','','',''],
			['73','wall','1588611988','Стенка фото4','','','',''],
			['74','wall','1588611883','Стенка фото5','','супер  стенка','Стенка фото5','36 000'],
			['75','wall','1588611874','Стенка фото6','','','',''],
			['76','wall','1588611942','Стенка фото7','','','',''],
			['78','childrens','1588611971','Детская комната фото2','','','',''],
			['79','childrens','1588611860','Детская комната фото3','','','',''],
			['80','childrens','1588611973','Детская комната фото4','','','',''],
			['81','childrens','1588611933','Детская комната фото5','','','',''],
			['82','hall','1588611898','Прихожая фото2','','','',''],
			['83','hall','1588611869','Прихожая фото3','','','',''],
			['84','hall','1588611837','Прихожая фото4','','','',''],
			['85','hall','1588611907','Прихожая фото5','','','',''],
			['86','hall','1588611832','Прихожая фото6','','','',''],
			['87','hall','1588612002','Прихожая фото7','','','Прихожая фото7',''],
			['88','bedroom','1588611769','Спальная комната фото3','','','',''],
			['89','bedroom','1588611802','Спальная комната фото4','','Супер спальня','Спальная комната фото4','100 000']]);
    }

    /**
     * @inheritdoc
     */
    public function safeDown()
    {
               
$this->truncateTable('{{%galery}}');
    }
}
